name: "yolov8_ensemble"
platform: "ensemble"
max_batch_size: 8
input [{
  name: "raw_image"
  data_type: TYPE_UINT8
  dims: [-1, -1, 3]
}]
output [{
  name: "detections"
  data_type: TYPE_FP32
  dims: [-1, 6]
}]
ensemble_scheduling {
  step [
    {
      model_name: "yolov8_preprocessing"
      model_version: -1
      input_map { key: "raw_image" value: "raw_image" }
      output_map { key: "processed" value: "preprocessed" }
    },
    {
      model_name: "yolov8_detector"
      model_version: -1
      input_map { key: "images" value: "preprocessed" }
      output_map { key: "output0" value: "raw_detections" }
    },
    {
      model_name: "yolov8_postprocessing"
      model_version: -1
      input_map { key: "raw_output" value: "raw_detections" }
      output_map { key: "detections" value: "detections" }
    }
  ]
}
version_policy: { latest: { num_versions: 1 } }
