name: "yolov8_postprocessing"
backend: "python"
max_batch_size: 8
input [{
  name: "raw_output"
  data_type: TYPE_FP32
  dims: [84, 8400]
}]
output [{
  name: "detections"
  data_type: TYPE_FP32
  dims: [-1, 6]
}]
instance_group [{ count: 2, kind: KIND_GPU }]
version_policy: { latest: { num_versions: 1 } }
