name: "yolov8_preprocessing"
backend: "python"
max_batch_size: 8
input [{
  name: "raw_image"
  data_type: TYPE_UINT8
  dims: [-1, -1, 3]
}]
output [{
  name: "processed"
  data_type: TYPE_FP32
  dims: [3, 640, 640]
}]
instance_group [{ count: 2, kind: KIND_GPU }]
version_policy: { latest: { num_versions: 1 } }
