name: "yolov8_detector"
platform: "tensorrt_plan"
max_batch_size: 8
input [{
  name: "images"
  data_type: TYPE_FP32
  dims: [3, 640, 640]
}]
output [{
  name: "output0"
  data_type: TYPE_FP32
  dims: [84, 8400]
}]
dynamic_batching { max_queue_delay_microseconds: 100 }
instance_group [{ count: 1, kind: KIND_GPU }]
version_policy: { latest: { num_versions: 1 } }
